module.exports = {
    
    scr: ["选择你的<br/>Hacash钱包", "根据使用场景和用户习惯选择最合适的钱包"],

    wlts: {
        create: ["一键生成地址","点击立即创建新地址，用来接收HAC和HACD", "网页，无需下载，支持所有设备", "立即创建"],
        online: ["在线网页钱包","打开网页就可进行HAC和HACD转账，随机或按密码创建地址","网页，无需下载，支持所有设备","立即使用"],
        offline: ["离线网页钱包","更加安全的网页钱包，可以离线操作","网页，需下载，支持所有设备","下载"],
        desktop: ["桌面钱包","含有最全面的功能，为追求安全的资深用户准备","需下载，支持Windows/Ubuntu/MacOS","下载"],
        cmds: ["命令行钱包","开发者专用，命令行操作界面","需自己编译，支持所有电脑系统","Github"],
        miner: ["矿工节点钱包","搭建全节点连接网页钱包，可转账或进行HACD手动竞价","网页，需下载，支持所有设备","下载"],
    },

    desktop: ["下载 Hacash 桌面钱包", "含有最全面的功能，为追求安全的资深用户准备"],

    pttl: "钱包工具",

    send: [
        "发送交易至主网",
        `将交易的 txbody 值粘贴到下面的框中，点击确认则提交到区块链网络进行确认
        （<b>注意：交易一旦发送无法撤回<b>）`,
        "确认发送",
    ],

    stat: [
        "查询交易状态",
        "将交易Hash（TxHash）值粘贴到下面的框中，点击确认查询交易状态",
        "确认查询",
    ],

    bnls: [
        "查询HAC余额",
        "将钱包地址输入或粘贴到下面的框中，一行一个或用逗号、空格隔开。点击“确认查询”则显示账户余额。一次查询不超过20个账号地址",
        "确认查询",
    ],

}
    